Documents/ЗавершениеИспытательногоСрока.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗавершениеИспытательногоСрока</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДанныеИспытательногоСрокаСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДанныеИспытательногоСрокаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеИспытательногоСрокаСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспытательныйСрокЗавершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродлениеИспытательногоСрока</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботаВОтпускеПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойПоВинеРаботника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойПоВинеРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойНеЗависящийОтРаботодателяИРаботника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствиеПоНевыясненнымПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускОсновной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтпускНеоплачиваемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускУчебныйОплачиваемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускУчебныйНеоплачиваемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Командировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствиеССохранениемОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеГосударственныхОбязанностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВыходныеДниОплачиваемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВыходныеДниНеоплачиваемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прогул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВынужденныйПрогул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускНаСанаторноКурортноеЛечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Болезнь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БолезньБезОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускНеоплачиваемыйПоРазрешениюРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускНеоплачиваемыйПоЗаконодательству</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговорПриостановлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗавершениеИспытательногоСрока/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ДатаЗавершения = ТекущаяДатаСеанса();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		Сотрудник = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	ИспытательныйСрокСотрудников.СформироватьДвиженияИспытательногоСрока(Движения, ДанныеДляПроведения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ПроверятьНахождениеНаИспытательномСроке", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый() Тогда
		// Очистим движения, сделанные текущим документом, для пересчета вторичных данных регистра "ИспытательныйСрокСотрудников".
		Движения.ДанныеИспытательногоСрокаСотрудников.ДополнительныеСвойства.Вставить("ИгнорироватьЗаписьДляАналитикиДанных", Истина);
		Движения.ДанныеИспытательногоСрокаСотрудников.Записать();
		Движения.ДанныеИспытательногоСрокаСотрудников.ДополнительныеСвойства.ИгнорироватьЗаписьДляАналитикиДанных = Ложь;
	КонецЕсли;	

	КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(
		Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник), "ДатаПриема,ИспытательныйСрокДатаЗавершения", Дата);
		
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Сотрудник %1 не находится на испытательном сроке.'"), Сотрудник);
	
	Если Не ЗначениеЗаполнено(КадровыеДанныеСотрудника[0].ИспытательныйСрокДатаЗавершения)
		Или (ЗначениеЗаполнено(КадровыеДанныеСотрудника[0].ИспытательныйСрокДатаЗавершения)
			И ДатаЗавершения > КадровыеДанныеСотрудника[0].ИспытательныйСрокДатаЗавершения)
		Или ДатаЗавершения < КадровыеДанныеСотрудника[0].ДатаПриема Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Сотрудник", ,Отказ);
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗавершениеИспытательногоСрока.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗавершениеИспытательногоСрока КАК ЗавершениеИспытательногоСрока
	|ГДЕ
	|	ЗавершениеИспытательногоСрока.Сотрудник = &Сотрудник
	|	И ЗавершениеИспытательногоСрока.Ссылка <> &Ссылка
	|	И ЗавершениеИспытательногоСрока.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ТекстСообщения = НСтр("ru = 'По сотруднику уже зарегистрировано завершение испытательного срока %1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Ссылка);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка, "Сотрудник", ,Отказ);
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ПроверятьНахождениеНаИспытательномСроке", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗавершениеИспытательногоСрока.ДатаЗавершения КАК Период,
	|	ЗавершениеИспытательногоСрока.Организация КАК Организация,
	|	ЗавершениеИспытательногоСрока.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗавершениеИспытательногоСрока.ДатаЗавершения КАК ДатаЗавершения,
	|	ИСТИНА КАК ИспытательныйСрокЗавершен,
	|	ЛОЖЬ КАК ПродлениеИспытательногоСрока
	|ИЗ
	|	Документ.ЗавершениеИспытательногоСрока КАК ЗавершениеИспытательногоСрока
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ЗавершениеИспытательногоСрока.Сотрудник = Сотрудники.Ссылка
	|ГДЕ
	|	ЗавершениеИспытательногоСрока.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ЗавершениеИспытательногоСрока.Ссылка = &Ссылка";
	
	ДанныеДляПроведения = Новый Структура("ИспытательныйСрокСотрудников");
	ДанныеДляПроведения.ИспытательныйСрокСотрудников = Запрос.Выполнить().Выгрузить();
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

#Область ПроверкаЗаполненияДокумента

Функция РезультатПроверкиПересеченийПериодовОтсутствия() Экспорт
	
	ИсходныеДанные = СостоянияСотрудников.ПустаяТаблицаДанныхСостоянийСотрудника();
	
	НоваяСтрока = ИсходныеДанные.Добавить();
	НоваяСтрока.Сотрудник = Сотрудник;
	НоваяСтрока.Состояние = Перечисления.СостоянияСотрудника.Работа;
	НоваяСтрока.Начало = ДатаЗавершения;
	НоваяСтрока.Окончание = ДатаЗавершения;
	
	Возврат СостоянияСотрудников.ПроверитьПересечениеПериодовОтсутствия(ИсходныеДанные, Ссылка);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
